import { CommonModule } from '@angular/common';
import { Component } from '@angular/core';

@Component({
  selector: 'app-vision-mission',
  imports:[CommonModule],
  templateUrl: './vision-mission.component.html',
  styleUrls: ['./vision-mission.component.css']
})
export class VisionMissionComponent {
  visionText: string = `كلية الطب بالأقصر هي صرح أكاديمي وسريري متميز يساهم بفعالية في تطوير العلوم الطبية والممارسة محلياً ودولياً، ويحدث تأثيراً إيجابياً على صحة المجتمع من خلال تقديم الرعاية الصحية الشاملة والمتكاملة بأعلى المعايير الدولية`;

  missionPoints: string[] = [
    'بناء وتخريج طبيب بخلفية علمية صلبة ومهارات سريرية متميزة',
    'الريادة المحلية والإقليمية والعالمية في التدريب الطبي وبيئة التعلم المبتكرة',
    'البحث العلمي والمساهمة العلمية محلياً ودولياً',
    'المساهمة الفعالة في تحقيق التنمية الشاملة في المجتمع وتحسين صحة المجتمع من خلال دمج وتطبيق البحث العلمي مع التدريب بالإضافة إلى المشاركة الفعالة في جميع الأمور المتعلقة بصحة المجتمع، بما في ذلك الإجراءات الوقائية والعلاجية والتشريعية.'
  ];

  connectionPoints: string[] = [
    'تساهم كلية الطب في التميز في التعليم الطبي والبحث العلمي، مما يؤدي إلى اقتصاد تنافسي مبني على الابتكار والمعرفة.',
    'مساعدة كلية الطب من خلال رؤيتها في خدمة احتياجات المجتمع من خلال تخريج أطباء متميزين لخدمة المجتمع وتحسين الرعاية الصحية للمصريين، بالإضافة إلى توظيف البحث العلمي لحل المشكلات الطبية في المجتمع المصري، مما يؤدي إلى تحقيق التنمية المستدامة وتحسين جودة الحياة للمصريين.',
    'تخدم كلية الطب بجامعة الأقصر شريحة كبيرة من الفقراء والطبقات الوسطى وتقدم لهم خدمات طبية متميزة، مما يساهم في تحقيق العدالة الاجتماعية وحق جميع الفئات في الحصول على خدمات طبية متميزة.'
  ];
About_Text: string = 'يعمل فريق خبرائنا بلا كلل لتحقيق رؤيتكم، مع ضمان أن كل مشروع ننفذه لا يقتصر على تلبية التوقعات فحسب، بل يتجاوزها. نحن ملتزمون بتحويل أفكاركم إلى تجارب رقمية مؤثرة تتناغم مع جمهوركم وتدفع نحو النجاح.';
}

